# ВСТРОЕННЫЕ ФУНКЦИИ print() и input()
# Документация PEP-8

my_string = "Привет!" # строки 

# print(my_string)


# a = input("Введите число a: ")
# b = input("Введите число b: ")

# c = int(a) + int(b) # конкатенация - способ форматирования строк

# print(c)


# **** типы данных ****

int_num = 777 # тип данных целое число 

float_num = 3.14 # тип данных число плавающей точкой 
 
string = "Привет мир"  # тип данных строка 

boolean = True # False # булев тип данных

# print( type(int_num))


# *** способ форматирования строк F-string ***

name = "John"
age = 10
weight = 30.5

s = f"Имя: {name} Возраст: {age} Вес: {weight}"

# print(s)


# *** арифметические операторы *** 

x = 2
y = 8

# print (x * y ) умножение

# print (x / y ) деление 


# print (x // y ) # целочисленное деление 

# print(x % y ) # деление по остатку 

print(x ** y) # возведение в степень
